import pandas as pd
import autosklearn.regression
import pickle

with open("model2.pkl", "rb") as f:
    model = pickle.load(f)
X = pd.DataFrame()
X['Район'] = [0]
X['Стадия строительной готовности на дату договора'] = [1]
X['Срок ввода в эксплуатацию - Старт продаж'] = [822]
X['Класс'] = [2]
X['Девелопер'] = [17]
X['Срок ввода в эксплуатацию - Договор'] = [378]
X['Квартал договора'] = [3]
X['Квартал регистрации'] = [3]
X['Тип сделки'] = [1]
X['Тип объекта'] = [1]
X['Секция'] = [1]
X['Этаж'] = [3]
X['Количество комнат'] = [3]
X['Площадь согласно ПД'] = [72.5]
X['Метод определения цены'] = [4]
X['Включение скидок/акций в ценообразование'] = [0]
X['Скидки по дате договора'] = [0]
X['Отделка по корпусу'] = [8]
X['Тип продавца'] =[1]
X['Тип покупателя'] = [0]
X['Кол-во покупателей'] = [2]
X['Тип ипотеки'] = [0]
X['Участие объекта в оптовой сделке'] = [1]
X['Срок в экспозиции до момента сделки, дней'] = [64]
X['Рост цены за 1 кв.м за период экспонирования'] = [1.3]

res = model.predict(X)
print('Цена за кв м: ' +str(res[0]))
print('Полная цена: '+str(X['Площадь согласно ПД'][0]*res[0]))